Repository: christhoval06/multy_app
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: Multiplication Tables
es: Tablas de Multiplicar

# selectTableTitle
source: Select a option
es: Selecciona una opción

# selectTablePrompt
source: Which table do you want to practice today?
es: ¿Qué tabla quieres practicar hoy?

# practiceButton
source: Practice!
es: ¡Practicar!

# practiceScreenTitle
source: Practicing Table {tableNumber}
es: Practicando la Tabla del {tableNumber}

# gradeButton
source: Grade
es: Calificar

# tryAgainButton
source: Try Again
es: Intentar de Nuevo

# summaryDialogTitle
source: Summary
es: Resumen

# congratulationsDialogTitle
source: Congratulations!
es: ¡Felicidades!

# summaryDialogContent
source: You got {correctCount} out of 12 correct answers.
es: Tienes {correctCount} de 12 respuestas correctas.

# correctAnswerWas
source: It was {correctAnswer}
es: Era {correctAnswer}

# practiceScreenTestButton
source: Take a Quiz!
es: ¡Hacer un Test!

# quizScreenTitle
source: Quiz: Table {tableNumber}
es: Test: Tabla del {tableNumber}

# quizTimeLabel
source: Time
es: Tiempo

# quizQuestionProgress
source: Question {current} / {total}
es: Pregunta {current} / {total}

# quizEndedMessage
source: Quiz Finished!
es: ¡Test Finalizado!

# quizTimeOutTitle
source: Time's Up!
es: ¡Se acabó el tiempo!

# quizCompleteTitle
source: Quiz Complete!
es: ¡Test Completado!

# quizScoreMessage
source: Your score: {score} out of {total}
es: Tu puntaje: {score} de {total}

# quizPercentageMessage
source: Percentage: {percentage}%
es: Porcentaje: {percentage}%

# quizPassedMessage
source: You passed!
es: ¡Aprobaste!

# quizFailedMessage
source: Keep practicing!
es: ¡Sigue practicando!

# quizRetryButton
source: Retry
es: Volver a intentar

# quizBackToMenuButton
source: Back to Menu
es: Volver al Menú

# quizCannotExitMessage
source: You cannot exit the quiz while it's in progress!
es: ¡No puedes salir del test mientras está en progreso!

# quizResultScreenTitle
source: Results: Table {tableNumber}
es: Resultados: Tabla del {tableNumber}

# quizPassedMessageLarge
source: CONGRATULATIONS!
es: ¡FELICIDADES!

# quizFailedMessageLarge
source: OH NO! KEEP TRYING!
es: ¡OH NO! ¡SIGUE INTENTANDO!

# quizScoreDetailed
source: You got {score} out of {total} correct answers.
es: Obtuviste {score} de {total} respuestas correctas.

# quizPercentageDetailed
source: That's a {percentage}% accuracy.
es: Eso es un {percentage}% de acierto.

# quizMainMenuButton
source: Main Menu
es: Menú Principal

# quizResultTimedOutInfo
source: You ran out of time on this attempt.
es: Se acabó el tiempo en esta ocasión.

# statisticsTitle
source: My Progress
es: Mi Progreso

# overallStats
source: Overall Statistics
es: Estadísticas Generales

# totalQuizzesPlayed
source: Total Quizzes Played: {count}
es: Total de Quizzes Jugados: {count}

# overallAccuracy
source: Overall Accuracy: {accuracy}%
es: Precisión General: {accuracy}%

# statsByTable
source: Statistics by Table
es: Estadísticas por Tabla

# tableNumberHeader
source: Table {number}
es: Tabla del {number}

# attempts
source: Attempts: {count}
es: Intentos: {count}

# accuracy
source: Accuracy: {accuracy}%
es: Precisión: {accuracy}%

# bestScore
source: Best: {correct}/{total}
es: Mejor: {correct}/{total}

# noAttemptsYet
source: No attempts yet for this table.
es: Aún no hay intentos para esta tabla.

# noStatsAvailable
source: No statistics available yet. Play some quizzes!
es: Aún no hay estadísticas disponibles. ¡Juega algunos quizzes!

# loadingStats
source: Loading statistics...
es: Cargando estadísticas...

# bestTime
source: Best Time: {time}
es: Mejor Tiempo: {time}

# menuStats
source: Show Stats
es: Ver Estadísticas

# menuSettings
source: Settings
es: Configuración

# settingsTitle
source: Settings
es: Configuración

# settingsLoading
source: Loading...
es: Cargando...

# settingsAppDescription
source: An educational application developed in Flutter for children aged 4 to 10 to learn and practice multiplication tables in a fun, fast, and interactive way.
es: Una aplicación educativa desarrollada en Flutter para que los niños de 4 a 10 años puedan aprender y practicar las tablas de multiplicación de forma divertida, rápida e interactiva.

# settingsVersionNotAvailable
source: Not available
es: No disponible

# settingsCouldNotOpenEmail
source: Could not open email app.
es: No se pudo abrir la app de correo.

# settingsCouldNotOpenLink
source: Could not open link: {urlString}
es: No se pudo abrir el enlace: {urlString}

# settingsDestructiveActionTitle
source: ⚠️ Destructive Action!
es: ⚠️ ¡Acción Destructiva!

# settingsDestructiveActionContent
source: You are about to delete ALL application data. This action CANNOT BE UNDONE. Are you absolutely sure?
es: Estás a punto de borrar TODOS los datos de la aplicación. Esta acción NO SE PUEDE DESHACER. ¿Estás absolutamente seguro?

# settingsCancel
source: CANCEL
es: CANCELAR

# settingsConfirmDeleteAll
source: YES, DELETE ALL
es: SÍ, BORRAR TODO

# settingsFinalConfirmationTitle
source: FINAL CONFIRMATION
es: CONFIRMACIÓN FINAL

# settingsFinalConfirmationContent
source: To confirm, type "DELETE" in the field below:
es: Para confirmar, escribe "BORRAR" en el campo de abajo:

# settingsFinalConfirmationHint
source: DELETE
es: BORRAR

# settingsDeleteDataNow
source: DELETE DATA NOW
es: BORRAR DATOS AHORA

# settingsIncorrectConfirmationText
source: Incorrect confirmation text.
es: Texto de confirmación incorrecto.

# settingsAllDataDeleted
source: All data has been deleted.
es: Todos los datos han sido borrados.

# settingsSectionAppInfo
source: App Information
es: Información de la App

# settingsAppVersion
source: App Version
es: Versión de la App

# settingsTermsAndConditions
source: Terms and Conditions
es: Términos y Condiciones

# settingsPrivacyPolicy
source: Privacy Policy
es: Política de Privacidad

# settingsSectionDeveloper
source: Developer
es: Desarrollador

# settingsDeveloperDescription
source: Developer of this application
es: Desarrollador de esta aplicación

# settingsPorfolio
source: Personal Site
es: Web Personal

# settingsGitHubProfile
source: GitHub Profile
es: Perfil de GitHub

# settingsContactDeveloper
source: Contact
es: Contactar

# settingsSectionSupport
source: Support
es: Soporte

# settingsReportProblem
source: Report a Problem
es: Reportar un Problema

# settingsSectionDataManagement
source: Data Management
es: Gestión de Datos

# settingsDeleteAllDataTitle
source: Delete All Data
es: Borrar Todos los Datos

# settingsDeleteAllDataSubtitle
source: Deletes all raffles, numbers, and buyers.
es: Elimina todas las rifas, números y compradores.

# studyTableTitle
source: Studying the Table of {tableNumber}
es: Estudiando la Tabla del {tableNumber}

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Speak
es: Hablar

# speakTimes
source: times
es: por

# speakEquals
source: equals
es: es igual a

# funFactTable2Multiplier1
source: You have 2 eyes to see the world!
es: ¡Tienes 2 ojos para ver el mundo!

# funFactTable2Multiplier2
source: A bicycle has 2 wheels.
es: Una bicicleta tiene 2 ruedas.

# funFactTable2Multiplier4
source: A pair of shoes are 2 shoes.
es: Un par de zapatos son 2 zapatos.

# funFactTable2Multiplier5
source: Most people have 2 hands and 2 feet.
es: La mayoría de las personas tienen 2 manos y 2 pies.

# funFactTable2Multiplier10
source: 20 is double 10, like having two 10-dollar bills!
es: 20 es el doble de 10, ¡como tener dos billetes de 10!

# funFactTable3Multiplier1
source: A tricycle has 3 wheels.
es: Un triciclo tiene 3 ruedas.

# funFactTable3Multiplier2
source: A traffic light has 3 lights: red, yellow, and green.
es: Un semáforo tiene 3 luces: rojo, amarillo y verde.

# funFactTable3Multiplier3
source: 3 x 3 is 9, a magical square number!
es: ¡3 x 3 es 9, un número cuadrado mágico!

# funFactTable3Multiplier4
source: A lucky clover usually has 3 leaves (sometimes 4!).
es: Un trébol de la suerte suele tener 3 hojas (¡a veces 4!).

# funFactTable4Multiplier1
source: A square has 4 equal sides.
es: Un cuadrado tiene 4 lados iguales.

# funFactTable4Multiplier2
source: Most cars have 4 wheels.
es: La mayoría de los carros tienen 4 ruedas.

# funFactTable4Multiplier3
source: The seasons of the year are 4: spring, summer, autumn, and winter.
es: Las estaciones del año son 4: primavera, verano, otoño e invierno.

# funFactTable5Multiplier1
source: You have 5 fingers on each hand!
es: ¡Tienes 5 dedos en cada mano!

# funFactTable5Multiplier2
source: A starfish commonly has 5 arms.
es: Una estrella de mar comúnmente tiene 5 brazos.

# funFactTable5Multiplier3
source: A pentagon is a shape with 5 sides.
es: Un pentágono es una figura con 5 lados.

# funFactTable5Multiplier4
source: A lustrum is 5 years.
es: Un lustro son 5 años.

# funFactTable5Multiplier10
source: Counting to 50 is like counting 5 times to 10.
es: Contar hasta 50 es como contar 5 veces hasta 10.

# funFactTable6Multiplier1
source: A common die has 6 faces.
es: Un dado común tiene 6 caras.

# funFactTable6Multiplier2
source: Insects have 6 legs.
es: Los insectos tienen 6 patas.

# funFactTable6Multiplier3
source: A guitar usually has 6 strings.
es: Una guitarra normalmente tiene 6 cuerdas.

# funFactTable7Multiplier1
source: There are 7 days in a week!
es: ¡Hay 7 días en una semana!

# funFactTable7Multiplier2
source: The colors of the rainbow are 7.
es: Los colores del arcoíris son 7.

# funFactTable7Multiplier3
source: Snow White met 7 dwarfs.
es: Blancanieves conoció a 7 enanitos.

# funFactTable7Multiplier4
source: The 7 wonders of the ancient world were amazing constructions.
es: Las 7 maravillas del mundo antiguo eran construcciones asombrosas.

# funFactTable8Multiplier1
source: A spider has 8 legs.
es: Una araña tiene 8 patas.

# funFactTable8Multiplier2
source: An octopus has 8 tentacles.
es: Un pulpo tiene 8 tentáculos.

# funFactTable8Multiplier3
source: In music, an octave has 8 notes.
es: En música, una octava tiene 8 notas.

# funFactTable9Multiplier1
source: A cat is said to have 9 lives (it's just a saying!).
es: Un gato tiene fama de tener 9 vidas (¡es solo un dicho!).

# funFactTable9Multiplier2
source: A full baseball game has 9 innings.
es: Un partido de béisbol completo tiene 9 entradas (innings).

# funFactTable9Multiplier3
source: Sudoku is played on a 9x9 grid.
es: Un Sudoku se juega en una cuadrícula de 9x9.

# funFactTable10Multiplier1
source: You have 10 fingers in total on your hands!
es: ¡Tienes 10 dedos en total en tus manos!

# funFactTable10Multiplier2
source: A decade is 10 years.
es: Una década son 10 años.

# funFactTable10Multiplier3
source: The decimal system we use is based on the number 10.
es: El sistema decimal que usamos se basa en el número 10.

# funFactTable10Multiplier5
source: 50 is half of 100, and 5 x 10!
es: 50 es la mitad de 100, ¡y 5 x 10!

# funFactTable11Multiplier1
source: A soccer team has 11 players on the field.
es: Un equipo de fútbol tiene 11 jugadores en el campo.

# funFactTable11Multiplier2
source: If you count your fingers and one foot, you almost get to 11 (it's 15)!
es: Si cuentas los dedos de tus manos y un pie, ¡casi llegas a 11 (son 15)!

# funFactTable12Multiplier1
source: A year has 12 months.
es: Un año tiene 12 meses.

# funFactTable12Multiplier2
source: A dozen is 12 things, like a dozen eggs!
es: Una docena son 12 cosas, ¡como una docena de huevos!

# funFactTable12Multiplier3
source: A clock shows 12 hours (in 12-hour format).
es: Un reloj marca 12 horas (en formato de 12 horas).

# funFactGeneric1
source: Math is like a superpower!
es: ¡Las matemáticas son como un superpoder!

# funFactGeneric2
source: Practicing a little bit every day makes you a tables champion.
es: Practicar un poquito cada día te hace un campeón de las tablas.

# funFactGeneric3
source: Keep it up, you're doing wonderfully!
es: ¡Sigue así, lo estás haciendo de maravilla!

# funFactGeneric4
source: Numbers help us understand the world.
es: Los números nos ayudan a entender el mundo.

# funFactGeneric5
source: Learning is the best adventure.
es: Aprender es la mejor aventura.

# funFactGeneric6
source: Every number has its own secret story.
es: Cada número tiene su propia historia secreta.

# funFactGeneric7
source: Wow, you are so smart!
es: ¡Wow, eres muy inteligente!

# funFactGeneric8
source: Discover the magic in every multiplication.
es: Descubre la magia en cada multiplicación.

# tableSelectionTitle
source: Select a Table
es: Selecciona una Tabla

# tableActionScreenTitle
source: Table of {tableNumber}: What to do?
es: Tabla del {tableNumber}: ¿Qué quieres hacer?

# studyAction
source: Study a Table
es: Estudiar una Tabla

# quizAction
source: Take a Quiz
es: Hacer un Quiz

# onboardingSkip
source: Skip
es: Saltar

# onboardingNext
source: Next
es: Siguiente

# onboardingStart
source: Start adventure
es: Comenzar aventura

# onboardingSlide1Title
source: Turn multiplication into your superpower
es: Convierte las tablas en tu superpoder

# onboardingSlide1Description
source: Learn with dynamic challenges and discover that math practice can feel exciting and fun.
es: Aprende con retos dinamicos y descubre que multiplicar puede ser increiblemente divertido.

# onboardingSlide2Title
source: Level up every round
es: Sube de nivel en cada ronda

# onboardingSlide2Description
source: Answer faster, build confidence, and sharpen your mind with short focused sessions.
es: Responde rapido, gana confianza y acelera tu mente con practicas cortas y efectivas.

# onboardingSlide3Title
source: Break your own records
es: Rompe tus propios records

# onboardingSlide3Description
source: Track your progress, celebrate every win, and master each table like a champion.
es: Sigue tu progreso, celebra tus logros y conquista cada tabla como un campeon.

# homeGreeting
source: What do you want to do today?
es: ¿Qué deseas hacer hoy?
